{
    "name": "Eylos",
    "baseAtk": 220,
    "basePwr": 0,
    "basePhyDef": 30,
    "baseMagDef": 30,
    "baseHp": 1800,
    "baseCharge": 100,
    "baseFluxCapacity": 5,
    "baseSurgeCapacity": 80,
    "baseEchoMemroyCapacity": 0,
    "baseMaxEnergy": 0,
    "baseCritRate": 5.0,
    "baseCritDamage": 50.0,
    "substat": "Crit DMG: 8.8%",
    "riftedFaction": "Rifted Technology",
    "riftedTech": "Fusion (Gale)",
    "riftedDisc": "",
    "faction": "Power",

    "passiveName": "Black Pearl Resonance",
    "passiveDesc": "When there are 2 or more Gale-Type characters in the team, all opponent's Gale RES is reduced by 12%. Additionally, Eylos gains a 12% DMG Bonus.",
    "riftedTalent": "Rifted Technology: Enhanced Fusion",
    "rTalentDesc": "Fluxes are converted into Enhanced Fuses, when Eylos deals Disorder DMG of his type, generates 4 Gale Disorder Particles that gradually fill up each Fuses. The properties of Disorder Particles and Fuses can be enhanced by Energy Regen and Energy Efficiency.",

    "talentBox": {
        "talent1": {
            "name": "Fusion Resonance: Gale",
            "desc": "Characters with Fusion Resonance: Gale can apply Strong Winds effect to the opponent by using certain skills."
        },

        "talent2": {
            "name": "Strong Winds",
            "desc": "When a character or opponent is affected by Strong Winds, reduces the DMG dealt by that character or opponent by 1%, max 36%. This effects lasts 2 Cycles."
        }
    },

    "normalAttackName": "Normal Attack - Energy Blast",
    "normalAttackDesc": "Eylos deals 31 (+44% Physical ATK) as Physical DMG.",

    "chargedAttackName": "Charged Attack - Stormeye System",
    "chargeCost": 30,
    "chargedAttackDesc": "Eylos casts upon the Stormeye creating a small whirlpool that deals 14 (+33% Physical ATK) as AoE Gale-Fusioned DMG to all opponents.",

    "normalSkillName": "Normal Skill - Black Pearl Singularity",
    "fluxCost": 1,
    "memoryNodes": {},
    "normalSkillDesc": "Eylos consumes all Enhanced Fuses and launches a small Black Pearl Singularity towards the opponent dealing 14 (+52% Physical ATK) as Physical DMG. Additional Enhanced Fuses enhance this DMG by 200%. Additionlly, depending on the number of consumed Enhanced Fuses, Eylos will apply 2/4/8/14/26 stacks of Strong Winds to the affected opponents.",

    "riftedSkillName": "Rifted Skill - Condensed Pearl Preservation",
    "surgeCost": 80,
    "energyCost": 0,
    "riftedSkillDesc": "Eylos unleashes a Condensed Pearl, dealing 54 (+49% Physical ATK) (+184% Knowledge Unit) as Fusioned-Gale DMG. If opponents are affected by Strong Winds, Eylos absorbs all stacks. The highest number of stacks taken from a single opponent determines both the number of follow-up attacks and their intensity.\nFor every twelve stacks absorbed, Eylos immediately gains another action and can cast Condensed Pearl Preservation again to releases the Condensed Pearl Emission once, and he may choose a new target for each release. The strength of each emission increases based on how many stacks lie within its current twelve-stack range: reaching four stacks fires one Dark Wind Blade, reaching eight stacks upgrades it to two Blades, and reaching twelve stacks unleashes three Blades. Each Dark Wind Blade deals 114 (+33% Physical ATK) (+221% Knowledge Unit) as Fusioned-Gale DMG.",

    "fragment1Name": "F1 - Abstract of Creation",
    "fragment1Desc": "Eylos DEF is increased by 20%. Additionally, Eylos takes 40% less Gale DMG from the opponents affected by Strong Winds.",
    "fragment2Name": "F2 - Last Survivor of Dakashan",
    "fragment2Desc": "For every 1 point of Knowledge Unit Eylos has, he gains 0.635% Gale DMG Bonus, up to 800 Knowledge Unit.",
    "fragment3Name": "F3 - Black Energy",
    "fragment3Desc": "\"Condensed Pearl Preservation\" level is increased by 3.",
    "fragment4Name": "F4 - Pearlescence Overriding",
    "fragment4Desc": "During the Condensed Pearl Preservation, Eylos gains 30% CRIT Rate and 70% CRIT DMG.",
    "fragment5Name": "F5 - Gravity Decomposition",
    "fragment5Desc": "\"Black Pearl Singularity\" level is increased by 3.",
    "fragment6Name": "F6 - Mighty Execution",
    "fragment6Desc": "Eylos gains 200 Knowledge Unit. During Condensed Pearl Preservaition, if Eylos releases maximum Black Windblade per Condensed Pearl Emission, Condensed Pearl Execution will strike the affected opponent dealing (+20% DMG Dealt from Condensed Pearl Emission) (+2200% Knowledge Unit) as Follow-Up Fusioned-Gale DMG.",

    "log": {
        "record1": {
            "version": "1.8Beta [Unknown]",
            "description": "Unreleased"
        }
    }
}